UB_Copy/src/InformationRegisters/УБ_ДелегированныеСотрудникиПодразделения/УБ_ДелегированныеСотрудникиПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ДелегированныеСотрудникиПодразделения</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗаместительРуководителя</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.УБ_ВидыОперацийДелегирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/Enums/УБ_ВидыОперацийДелегирования/УБ_ВидыОперацийДелегирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_ВидыОперацийДелегирования</name>
  <enumValues>
    <name>ПодсистемаМотивации</name>
  </enumValues>
  <enumValues>
    <name>ПодсистемаПланирования</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/InformationRegisters/УБ_ДелегированныеСотрудникиПодразделения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДелегированныхСотрудниковПодразделения(Таблица, Движения, Отказ) Экспорт
	
	Если Отказ Или Таблица.Количество() = 0 Тогда	
		Возврат;
	КонецЕсли; 

	ДвиженияДелегированныеСотрудникиПодразделения = Движения.УБ_ДелегированныеСотрудникиПодразделения;
	ДвиженияДелегированныеСотрудникиПодразделения.Записывать = Истина;
	ДвиженияДелегированныеСотрудникиПодразделения.Загрузить(Таблица); 	
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЗначениеРазрешено(Подразделение)";

КонецПроцедуры

#КонецОбласти

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.УБ_ДелегированныеСотрудникиПодразделения.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "1.0.2.4";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение в существующих записях  регистра ""Делегированные сотрудники подразделений"" добавленного измерения ""Вид операции"" значением по умолчанию'");
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	 //Выберем всех регистраторов регистра
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
        | УБ_ДелегированныеСотрудникиПодразделения.Регистратор
        |ИЗ
        | РегистрСведений.УБ_ДелегированныеСотрудникиПодразделения КАК УБ_ДелегированныеСотрудникиПодразделения";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
	        НаборЗаписей = РегистрыСведений.УБ_ДелегированныеСотрудникиПодразделения.СоздатьНаборЗаписей(); 
	        НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
	        НаборЗаписей.Прочитать();
	        Для каждого Запись Из НаборЗаписей Цикл
	            Запись.ВидОперации = Перечисления.УБ_ВидыОперацийДелегирования.ПодсистемаПланирования;
	        КонецЦикла;
	        НаборЗаписей.Записать();
				
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось заполнить запись регистра ""Делегирование сотрудников подразделения "" ""%1"" по причине: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				Выборка.Запись,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Выборка.Регистратор.Метаданные(),
				Выборка.Регистратор,
				ТекстСообщения);
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
